[
    {
        "company": "Fraunhofer Institute for Integrated Circuits IIS",
        "company_location": "Nürnberg, Germany",
        "role": "Research Assistant",
        "team": "Positioning and Networks",
        "time_duration": " 2019 - Present",
        "details": [
            {
                "title": "Smart Sensing and Analytics",
                "description": "MSc. Internship, built a Scikit-Learn and TensorFlow based Machine-Learning pipeline for classification of LOS/NLOS 5G and GNSS signal to further enhance positioning algorithm accuracy. Created Jupyter notebooks for ML-pipeline and documented data preprocessing. Performed ANOVA testing and PCA for feature selection. Migrated code for Kalman filter from MATLAB into python and ran unit-tests to verify and debug code execution.",
                "languages": " Python MATLAB SketchUp Oktal-SE SE-NAV"
            },
            {
                "title": "Sensor Fusion and Localization",
                "description": "Designed a new Positioning Referece Signal for 5G (3GPP Release 16) and compared the positioning accuracy of state of the art with LTE-based OTDOA multilateration. Implemented a MATLAB simulation using a statistical Channel modeland Ray-tracing model of Indoor Office environment.Added PRS module to the company codebase using CI/CD pipeline. Built a GUI to visualize real-time TDOA simulation with mobile base stations.",
                "languages": "Matlab C++ SketchUp"
            },
            {
                "title": "Smart Sensing and Analytics",
                "description": "Assisted a team in developing a testbed for 5G - New Radio signalling. Preprocessed Bayern state survey data to generate a 3D model of the city for channel modelling. Executed moving and coverage simulations for 5G and GNSS networks. Performed remote-controlled tests using Sim-Gen via python scripts over TCP/IP for GNSS and 5G hybrid positioning.",
                "languages": " Python MATLAB SketchUp Blender Spirent SimGEN Oktal-SE SE-NAV"
            }
        ]
    },
    {
        "company": "Jacobs University Bremen",
        "company_location": "Bremen, Germany",
        "role": "Student Assistant",
        "team": "Cognitive Science Lab - Prof. Dr. Adele Diedrich",
        "time_duration": "Apr 2019 - May 2019",
        "details": [
            {
                "title": "Monte-Carlo Simulations",
                "description": "Developed and debugged a series of Monte-Carlo simulations in MATLAB for psychology experiments: Multiattribute attention switching (MAAS) model and Multi-stage sequential sampling models with finite or infinite horizon and variable boundaries. Implemented tests to verify the correct logic of developed simulations.",
                "languages": "MATLAB"
            }
        ]
    }
]